manual_run_1/172.31.50.13_1m-detector.log
hostname=ip-172-31-50-13, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.19-44-g8dbd-dirty, flags=1
<ip-172-31-50-13> 1m-detector-write-split: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=posixaio, iodepth=4
<ip-172-31-50-13> 1m-detector-prelayout: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=posixaio, iodepth=4
<ip-172-31-50-13> ...
<ip-172-31-50-13> Starting 5 processes
<ip-172-31-50-13> 1m-detector-prelayout: you need to specify size=
<ip-172-31-50-13> fio: pid=0, err=22/file:filesetup.c:1057, func=total_file_size, error=Invalid argument
<ip-172-31-50-13> 1m-detector-prelayout: you need to specify size=
<ip-172-31-50-13> fio: pid=0, err=22/file:filesetup.c:1057, func=total_file_size, error=Invalid argument
<ip-172-31-50-13> 1m-detector-prelayout: you need to specify size=
<ip-172-31-50-13> fio: pid=0, err=22/file:filesetup.c:1057, func=total_file_size, error=Invalid argument
<ip-172-31-50-13> 
client <172.31.50.13>: exited with error 3
1m-detector-write-split: (groupid=0, jobs=5): err=22 (file:filesetup.c:1057, func=total_file_size, error=Invalid argument): pid=32273: Sun Apr 19 10:20:47 2020
  Description  : ['detector write, separate workloads']
  read: IOPS=496, BW=496MiB/s (520MB/s)(46.4GiB/95732msec)
    slat (nsec): min=982, max=25460, avg=1858.79, stdev=907.93
    clat (usec): min=1066, max=11697, avg=1722.95, stdev=451.46
     lat (usec): min=1068, max=11700, avg=1724.81, stdev=451.46
    clat percentiles (usec):
     |  1.00th=[ 1385],  5.00th=[ 1450], 10.00th=[ 1483], 20.00th=[ 1516],
     | 30.00th=[ 1549], 40.00th=[ 1582], 50.00th=[ 1614], 60.00th=[ 1663],
     | 70.00th=[ 1713], 80.00th=[ 1795], 90.00th=[ 1942], 95.00th=[ 2180],
     | 99.00th=[ 4424], 99.50th=[ 4621], 99.90th=[ 5211], 99.95th=[ 5342],
     | 99.99th=[ 5866]
   bw (  KiB/s): min=466943, max=593920, per=100.00%, avg=508468.29, stdev=20768.65, samples=190
   iops        : min=  455, max=  580, avg=496.55, stdev=20.28, samples=190
  write: IOPS=304, BW=305MiB/s (319MB/s)(22.9GiB/77047msec); 0 zone resets
    slat (nsec): min=12238, max=49853, avg=25945.51, stdev=4508.15
    clat (usec): min=295, max=10027, avg=345.16, stdev=69.92
     lat (usec): min=311, max=10055, avg=371.10, stdev=69.66
    clat percentiles (usec):
     |  1.00th=[  306],  5.00th=[  310], 10.00th=[  310], 20.00th=[  314],
     | 30.00th=[  318], 40.00th=[  322], 50.00th=[  330], 60.00th=[  367],
     | 70.00th=[  371], 80.00th=[  375], 90.00th=[  379], 95.00th=[  388],
     | 99.00th=[  400], 99.50th=[  408], 99.90th=[  420], 99.95th=[  429],
     | 99.99th=[  474]
   bw (  KiB/s): min=276480, max=339968, per=100.00%, avg=312442.36, stdev=14628.25, samples=153
   iops        : min=  270, max=  332, avg=305.12, stdev=14.29, samples=153
  lat (usec)   : 500=33.06%, 750=0.01%
  lat (msec)   : 2=61.37%, 4=4.29%, 10=1.28%, 20=0.01%
  cpu          : usr=0.50%, sys=5.01%, ctx=746341, majf=0, minf=131
  IO depths    : 1=98.8%, 2=0.3%, 4=0.9%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=47503,23464,0,0 short=0,0,0,0 dropped=0,0,0,0

Run status group 0 (all jobs):
   READ: bw=496MiB/s (520MB/s), 496MiB/s-496MiB/s (520MB/s-520MB/s), io=46.4GiB (49.8GB), run=95732-95732msec
  WRITE: bw=305MiB/s (319MB/s), 305MiB/s-305MiB/s (319MB/s-319MB/s), io=22.9GiB (24.6GB), run=77047-77047msec
### (1) done 172.31.50.13_1m-detector #############################################